"""
Task1.
Ivanyuk D 10.04.2020
1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя
несколько чисел и строк и сохраните в переменные, выведите на экран.
"""

#  Запрашиваем значения и выводим на печать
year = input('В каком году человек впервые совершил полет в космос?\n')
day = input('Какого числа?\n')

surname = input('Фамилия первого космонавта?\n')
name = input('Имя первого космонавта?\n')

print(f'{day} апреля {year} {name} {surname} полетел в космос!')






